<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of DinoXcope Software</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.dinoxcope</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DinoXcope</string>
		<key>SEARCH_URL</key>
		<string>https://www.dinolite.us/en/downloads</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https:\/\/www\.dinolite\.us\/dl\/archive\/DinoXcope_OSX_[\d.]+.dmg)</string>
            </dict>
        </dict>
        <dict>
    	   <key>Processor</key>
    	   <string>URLDownloader</string>
    	   <key>Arguments</key>
    	   <dict>
    	       <key>url</key>
    	       <string>%url%</string>
               <key>filename</key>
               <string>%NAME%.dmg</string>
    	   </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/DinoXcope.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.anmo.DinoXcope" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TDSK62KZ54)</string>
            </dict>
        </dict>
	    <dict>
	        <key>Processor</key>
            <string>EndOfCheckPhase</string>
	    </dict>
	</array>
</dict>
</plist>
